{"data":{"markdownRemark":{"fields":{"slug":"/docs/React/react-native"},"id":"bd963851-dd6f-5dac-b4af-5f80846d188e","html":"<h1>\n  React Native\n</h1>\n<p>En 2015, deux ans après l’ouverture du code en open source, l'équipe qui a créé reactJS réitère l’exploit en publiant la version mobile avec React Native qui fut immédiatement adopté par la communauté.</p>\n<p>React Native est un framework pour créer des applications natives en utilisant JavaScript. React Native compile les composants d’application native, ce qui vous permet de créer des applications mobiles natives. Dans React JS, React est le concept de base de React DOM pour la plateforme web, alors qu’avec React Native, React est toujours le concept de base mais de React Native. La syntaxe et le workflow restent donc similaires, mais les composants sont différents.</p>\n<h2 id=\"avantages-de-react-native\"><a href=\"#avantages-de-react-native\" aria-label=\"avantages de react native permalink\" class=\"post-toc-anchor\"><svg aria-hidden=\"true\" focusable=\"false\" height=\"16\" version=\"1.1\" viewBox=\"0 0 16 16\" width=\"16\"><path fill-rule=\"evenodd\" d=\"M4 9h1v1H4c-1.5 0-3-1.69-3-3.5S2.55 3 4 3h4c1.45 0 3 1.69 3 3.5 0 1.41-.91 2.72-2 3.25V8.59c.58-.45 1-1.27 1-2.09C10 5.22 8.98 4 8 4H4c-.98 0-2 1.22-2 2.5S3 9 4 9zm9-3h-1v1h1c1 0 2 1.22 2 2.5S13.98 12 13 12H9c-.98 0-2-1.22-2-2.5 0-.83.42-1.64 1-2.09V6.25c-1.09.53-2 1.84-2 3.25C6 11.31 7.55 13 9 13h4c1.45 0 3-1.69 3-3.5S14.5 6 13 6z\"></path></svg></a>Avantages de React Native</h2>\n<ul>\n<li>React Native est livré avec des modules natifs et des composants natifs qui améliorent les performances. À la différence de Cordova, PhoneGap et d’autres frameworks multiplateformes qui rendent le code via WebView, React Native restitue certains composants de code avec des API natives.</li>\n<li>React Native a tous les avantages que React.js vous a apporté.</li>\n<li>Vous n’avez pas à créer la même application pour iOS et Android séparément, car React Native permet à vos développeurs de réutiliser la couche logique commune.</li>\n<li>La structure basée sur les composants de React Native permet aux développeurs de créer des applications avec une approche de développement web plus agile que la plupart des frameworks hybrides, et sans aucun réseau.</li>\n<li>Si vous connaissez JavaScript, React Native sera facile à acquérir, permettant à la plupart des développeurs Web frontaux d’être un développeur mobile. Tout ce que vous devez savoir, c’est JavaScript, les API de plate-forme, certains éléments de l’interface utilisateur native et tous les autres modèles de conception spécifiques à la plate-forme.</li>\n<li>Pas besoin de réviser votre ancienne application. Tout ce que vous avez à faire est d’ajouter les composants de l’interface utilisateur native de React dans le code de votre application existante, sans avoir à réécrire.</li>\n<li>Le développement d’applications natives est généralement synonyme d’inefficacité, de temps de déploiement plus lent et de productivité moindre pour les développeurs. React Native est synonyme de rapidité, de réactivité et d’agilité du développement d’applications Web, ainsi que d’un traitement efficace et de la meilleure expérience utilisateur de l’espace hybride, pour offrir à vos utilisateurs une expérience d’application native.</li>\n</ul>","frontmatter":{"date":null,"title":"React Native","root":"/docs"}}},"pageContext":{"isCreatedByStatefulCreatePages":false}}